leomil72/tiny/avr/boards.txt
# Extra Atmel MCU-based Board Configuration by Leo72
#
# For more information see:
# - https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5---3rd-party-Hardware-specification
# - https://github.com/arduino/Arduino/wiki/Arduino-Hardware-Cores-migration-guide-from-1.0-to-1.6
#

##############################################################

menu.cpu=Micro

###########################################################################

tinyx4.name=ATtiny24/44/84

tinyx4.bootloader.tool=avrdude
tinyx4.bootloader.unlock_bits=0xFF
tinyx4.bootloader.lock_bits=0xFF
tinyx4.build.board=AVR_TINYX4

tinyx4.menu.cpu.attiny84at16=ATtiny84 @ 16 MHz  (external crystal; 4.3 V BOD)

tinyx4.menu.cpu.attiny84at16.upload.tool=arduino:arduinoisp
tinyx4.menu.cpu.attiny84at16.upload.maximum_size=8192
tinyx4.menu.cpu.attiny84at16.upload.maximum_data_size=512

# Frequency 8.0- MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms; [CKSEL=1111 SUT=11]
# Brown-out detection level at VCC=4.3 V; [BODLEVEL=100]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]
# Serial program downloading (SPI) enabled; [SPIEN=0]

tinyx4.menu.cpu.attiny84at16.bootloader.low_fuses=0xFF
tinyx4.menu.cpu.attiny84at16.bootloader.high_fuses=0xD4
tinyx4.menu.cpu.attiny84at16.bootloader.extended_fuses=0xFF
tinyx4.menu.cpu.attiny84at16.bootloader.file=empty/empty84at16.hex

tinyx4.menu.cpu.attiny84at16.build.mcu=attiny84
tinyx4.menu.cpu.attiny84at16.build.f_cpu=16000000L
tinyx4.menu.cpu.attiny84at16.build.core=tiny
 
###########################################################################

tinyx4.menu.cpu.attiny84at8=ATtiny84 @ 8 MHz  (internal oscillator; BOD disabled)

tinyx4.menu.cpu.attiny84at8.upload.tool=arduino:arduinoisp
tinyx4.menu.cpu.attiny84at8.upload.maximum_size=8192
tinyx4.menu.cpu.attiny84at8.upload.maximum_data_size=512

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms; [CKSEL=0010 SUT=10]; default value
# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

tinyx4.menu.cpu.attiny84at8.bootloader.low_fuses=0xE2
tinyx4.menu.cpu.attiny84at8.bootloader.high_fuses=0xD7
tinyx4.menu.cpu.attiny84at8.bootloader.extended_fuses=0xFF
tinyx4.menu.cpu.attiny84at8.bootloader.file=empty/empty84at8.hex

tinyx4.menu.cpu.attiny84at8.build.mcu=attiny84
tinyx4.menu.cpu.attiny84at8.build.f_cpu=8000000L
tinyx4.menu.cpu.attiny84at8.build.core=tiny
 
###########################################################################

tinyx4.menu.cpu.attiny84at1=ATtiny84 @ 1 MHz  (internal oscillator; BOD disabled)

tinyx4.menu.cpu.attiny84at1.upload.tool=arduino:arduinoisp
tinyx4.menu.cpu.attiny84at1.upload.maximum_size=8192
tinyx4.menu.cpu.attiny84at1.upload.maximum_data_size=512

# Default clock (slowly rising power; long delay to clock; 8 MHz internal; divide clock by 8)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms; [CKSEL=0010 SUT=10]; default value
# Divide clock by 8 internally; [CKDIV8=0]
# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

tinyx4.menu.cpu.attiny84at1.bootloader.low_fuses=0x62
tinyx4.menu.cpu.attiny84at1.bootloader.high_fuses=0xD7
tinyx4.menu.cpu.attiny84at1.bootloader.extended_fuses=0xFF
tinyx4.menu.cpu.attiny84at1.bootloader.file=empty/empty84at1.hex

tinyx4.menu.cpu.attiny84at1.build.mcu=attiny84
tinyx4.menu.cpu.attiny84at1.build.f_cpu=1000000L
tinyx4.menu.cpu.attiny84at1.build.core=tiny
 
###########################################################################

tinyx4.menu.cpu.attiny44at8=ATtiny44 @ 8 MHz  (internal oscillator; BOD disabled)

tinyx4.menu.cpu.attiny44at8.upload.tool=arduino:arduinoisp
tinyx4.menu.cpu.attiny44at8.upload.maximum_size=4096
tinyx4.menu.cpu.attiny44at8.upload.maximum_data_size=256

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms; [CKSEL=0010 SUT=10]; default value
# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

tinyx4.menu.cpu.attiny44at8.bootloader.low_fuses=0xE2
tinyx4.menu.cpu.attiny44at8.bootloader.high_fuses=0xD7
tinyx4.menu.cpu.attiny44at8.bootloader.extended_fuses=0xFF
tinyx4.menu.cpu.attiny44at8.bootloader.file=empty/empty44at8.hex

tinyx4.menu.cpu.attiny44at8.build.mcu=attiny44
tinyx4.menu.cpu.attiny44at8.build.f_cpu=8000000L
tinyx4.menu.cpu.attiny44at8.build.core=tiny
 
###########################################################################

tinyx4.menu.cpu.attiny44at1.name=ATtiny44 @ 1 MHz  (internal oscillator; BOD disabled)

tinyx4.menu.cpu.attiny44at1.upload.tool=arduino:arduinoisp
tinyx4.menu.cpu.attiny44at1.upload.maximum_size=4096
tinyx4.menu.cpu.attiny44at1.upload.maximum_data_size=256

# Default clock (slowly rising power; long delay to clock; 8 MHz internal; divide clock by 8)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms; [CKSEL=0010 SUT=10]; default value
# Divide clock by 8 internally; [CKDIV8=0]
# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

tinyx4.menu.cpu.attiny44at1.bootloader.low_fuses=0x62
tinyx4.menu.cpu.attiny44at1.bootloader.high_fuses=0xD7
tinyx4.menu.cpu.attiny44at1.bootloader.extended_fuses=0xFF
tinyx4.menu.cpu.attiny44at1.bootloader.file=empty/empty44at1.hex

tinyx4.menu.cpu.attiny44at1.build.mcu=attiny44
tinyx4.menu.cpu.attiny44at1.build.f_cpu=1000000L
tinyx4.menu.cpu.attiny44at1.build.core=tiny
 
###########################################################################

tinyx4.menu.cpu.attiny24at16=ATtiny24 @ 16 MHz  (external crystal; BOD disabled)

tinyx4.menu.cpu.attiny24at16.upload.tool=arduino:arduinoisp
tinyx4.menu.cpu.attiny24at16.upload.maximum_size=2048
tinyx4.menu.cpu.attiny24at16.upload.maximum_data_size=2128

# Ext. Crystal Osc.; Frequency 8.0-    MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms;  [CKSEL=1111 SUT=11]
# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]
# Serial program downloading (SPI) enabled; [SPIEN=0]

tinyx4.menu.cpu.attiny24at16.bootloader.low_fuses=0xFF
tinyx4.menu.cpu.attiny24at16.bootloader.high_fuses=0xD7
tinyx4.menu.cpu.attiny24at16.bootloader.extended_fuses=0xFF
tinyx4.menu.cpu.attiny24at16.bootloader.file=empty/empty24at16.hex

tinyx4.menu.cpu.attiny24at16.build.mcu=attiny24
tinyx4.menu.cpu.attiny24at16.build.f_cpu=16000000L
tinyx4.menu.cpu.attiny24at16.build.core=tiny
 
###########################################################################

tinyx5.name=ATtiny25/45/85

tinyx5.bootloader.tool=avrdude
tinyx5.bootloader.unlock_bits=0xFF
tinyx5.bootloader.lock_bits=0xFF
tinyx5.build.board=AVR_TINYX5

