leomil72/tiny/avr/boards.txt
tinyx5.menu.cpu.attiny85at128.build.mcu=attiny85
tinyx5.menu.cpu.attiny85at128.build.f_cpu=128000L
tinyx5.menu.cpu.attiny85at128.build.core=tiny
 
###########################################################################

tinyx5.menu.cpu.attiny45at8=ATtiny45 @ 8 MHz

tinyx5.menu.cpu.attiny45at8.upload.tool=arduino:arduinoisp
tinyx5.menu.cpu.attiny45at8.upload.maximum_size=4096
tinyx5.menu.cpu.attiny45at8.upload.maximum_data_size=256

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms; [CKSEL=0010 SUT=10]; default value
# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

tinyx5.menu.cpu.attiny45at8.bootloader.low_fuses=0xE2
tinyx5.menu.cpu.attiny45at8.bootloader.high_fuses=0xD7
tinyx5.menu.cpu.attiny45at8.bootloader.extended_fuses=0xFF
tinyx5.menu.cpu.attiny45at8.bootloader.file=empty/empty45at8.hex

tinyx5.menu.cpu.attiny45at8.build.mcu=attiny45
tinyx5.menu.cpu.attiny45at8.build.f_cpu=8000000L
tinyx5.menu.cpu.attiny45at8.build.core=tiny
 
###########################################################################

tinyx5.menu.cpu.attiny45at1=ATtiny45 @ 1 MHz

tinyx5.menu.cpu.attiny45at1.upload.tool=arduino:arduinoisp
tinyx5.menu.cpu.attiny45at1.upload.maximum_size=4096
tinyx5.menu.cpu.attiny45at1.upload.maximum_data_size=256

# Default clock (slowly rising power; long delay to clock; 8 MHz internal; divide clock by 8)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms; [CKSEL=0010 SUT=10]; default value
# Divide clock by 8 internally; [CKDIV8=0]
# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

tinyx5.menu.cpu.attiny45at1.bootloader.low_fuses=0x62
tinyx5.menu.cpu.attiny45at1.bootloader.high_fuses=0xD7
tinyx5.menu.cpu.attiny45at1.bootloader.extended_fuses=0xFF
tinyx5.menu.cpu.attiny45at1.bootloader.file=empty/empty45at1.hex

tinyx5.menu.cpu.attiny45at1.build.mcu=attiny45
tinyx5.menu.cpu.attiny45at1.build.f_cpu=1000000L
tinyx5.menu.cpu.attiny45at1.build.core=tiny
 
###########################################################################

tinyx5.menu.cpu.attiny25at8=ATtiny25 @ 8 MHz

tinyx5.menu.cpu.attiny25at8.upload.tool=arduino:arduinoisp
tinyx5.menu.cpu.attiny25at8.upload.maximum_size=2048
tinyx5.menu.cpu.attiny25at8.upload.maximum_data_size=128

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms; [CKSEL=0010 SUT=10]; default value
# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

tinyx5.menu.cpu.attiny25at8.bootloader.low_fuses=0xE2
tinyx5.menu.cpu.attiny25at8.bootloader.high_fuses=0xD7
tinyx5.menu.cpu.attiny25at8.bootloader.extended_fuses=0xFF
tinyx5.menu.cpu.attiny25at8.bootloader.file=empty/empty25at8.hex

tinyx5.menu.cpu.attiny25at8.build.mcu=attiny25
tinyx5.menu.cpu.attiny25at8.build.f_cpu=8000000L
tinyx5.menu.cpu.attiny25at8.build.core=tiny
 
###########################################################################

tinyx5.menu.cpu.attiny25at1=ATtiny25 @ 1 MHz

tinyx5.menu.cpu.attiny25at1.upload.tool=arduino:arduinoisp
tinyx5.menu.cpu.attiny25at1.upload.maximum_size=2048
tinyx5.menu.cpu.attiny25at1.upload.maximum_data_size=128

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms; [CKSEL=0010 SUT=10]; default value
# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

tinyx5.menu.cpu.attiny25at1.bootloader.low_fuses=0x62
tinyx5.menu.cpu.attiny25at1.bootloader.high_fuses=0xD7
tinyx5.menu.cpu.attiny25at1.bootloader.extended_fuses=0xFF
tinyx5.menu.cpu.attiny25at1.bootloader.file=empty/empty25at1.hex

tinyx5.menu.cpu.attiny25at1.build.mcu=attiny25
tinyx5.menu.cpu.attiny25at1.build.f_cpu=1000000L
tinyx5.menu.cpu.attiny25at1.build.core=tiny 
 
###########################################################################

tinyx313.name=ATtiny2313/4313

tinyx313.bootloader.unlock_bits=0xFF
tinyx313.bootloader.lock_bits=0xFF
tinyx313.bootloader.tool=avrdude
tinyx313.build.board=AVR_TINYX313

tinyx313.menu.cpu.attiny4313at8=ATtiny4313 @ 8 MHz

tinyx313.menu.cpu.attiny4313at8.upload.tool=arduino:arduinoisp
tinyx313.menu.cpu.attiny4313at8.upload.maximum_size=4096
tinyx313.menu.cpu.attiny4313at8.upload.maximum_data_size=256

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time: 14 CK + 65 ms; [CKSEL=0100 SUT=10]; default value 
# Brown-out detection disabled; [BODLEVEL=111]
# Serial program downloading (SPI) enabled; [SPIEN=0]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

tinyx313.menu.cpu.attiny4313at8.bootloader.low_fuses=0xE4
tinyx313.menu.cpu.attiny4313at8.bootloader.high_fuses=0x9F
tinyx313.menu.cpu.attiny4313at8.bootloader.extended_fuses=0xFF
tinyx313.menu.cpu.attiny4313at8.bootloader.file=empty/empty4313at8.hex

tinyx313.menu.cpu.attiny4313at8.build.mcu=attiny4313
tinyx313.menu.cpu.attiny4313at8.build.f_cpu=8000000L
tinyx313.menu.cpu.attiny4313at8.build.core=tiny
 
###########################################################################

tinyx313.menu.cpu.attiny4313at1=ATtiny4313 @ 1 MHz

tinyx313.menu.cpu.attiny4313at1.upload.tool=arduino:arduinoisp
tinyx313.menu.cpu.attiny4313at1.upload.maximum_size=4096
tinyx313.menu.cpu.attiny4313at1.upload.maximum_data_size=256

# Default clock (slowly rising power; long delay to clock; 8 MHz internal; divide clock by 8)
# Int. RC Osc. 8 MHz; Start-up time: 14 CK + 65 ms; [CKSEL=0100 SUT=10]; default value 
# Divide clock by 8 internally; [CKDIV8=0]
# Brown-out detection disabled; [BODLEVEL=111]
# Serial program downloading (SPI) enabled; [SPIEN=0]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

tinyx313.menu.cpu.attiny4313at1.bootloader.low_fuses=0x64
tinyx313.menu.cpu.attiny4313at1.bootloader.high_fuses=0x9F
tinyx313.menu.cpu.attiny4313at1.bootloader.extended_fuses=0xFF
tinyx313.menu.cpu.attiny4313at1.bootloader.file=empty/empty4313at1.hex

tinyx313.menu.cpu.attiny4313at1.build.mcu=attiny4313
tinyx313.menu.cpu.attiny4313at1.build.f_cpu=1000000L
tinyx313.menu.cpu.attiny4313at1.build.core=tiny
 
###########################################################################

tinyx313.menu.cpu.attiny2313at8=ATtiny2313 @ 8 MHz

tinyx313.menu.cpu.attiny2313at8.upload.tool=arduino:arduinoisp
tinyx313.menu.cpu.attiny2313at8.upload.maximum_size=2048
tinyx313.menu.cpu.attiny2313at8.upload.maximum_data_size=128

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time: 14 CK + 65 ms; [CKSEL=0100 SUT=10]; default value 
# Brown-out detection disabled; [BODLEVEL=111]
# Serial program downloading (SPI) enabled; [SPIEN=0]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

tinyx313.menu.cpu.attiny2313at8.bootloader.low_fuses=0xE4
tinyx313.menu.cpu.attiny2313at8.bootloader.high_fuses=0x9F
tinyx313.menu.cpu.attiny2313at8.bootloader.extended_fuses=0xFF
tinyx313.menu.cpu.attiny2313at8.bootloader.file=empty/empty2313at8.hex

tinyx313.menu.cpu.attiny2313at8.build.mcu=attiny2313
tinyx313.menu.cpu.attiny2313at8.build.f_cpu=8000000L
tinyx313.menu.cpu.attiny2313at8.build.core=tiny
 
###########################################################################

tinyx313.menu.cpu.attiny2313at1=ATtiny2313 @ 1 MHz

tinyx313.menu.cpu.attiny2313at1.upload.tool=arduino:arduinoisp
tinyx313.menu.cpu.attiny2313at1.upload.maximum_size=2048
tinyx313.menu.cpu.attiny2313at1.upload.maximum_data_size=128

# Default clock (slowly rising power; long delay to clock; 8 MHz internal; divide clock by 8)
# Int. RC Osc. 8 MHz; Start-up time: 14 CK + 65 ms; [CKSEL=0100 SUT=10]; default value 
# Divide clock by 8 internally; [CKDIV8=0]
# Brown-out detection disabled; [BODLEVEL=111]
# Serial program downloading (SPI) enabled; [SPIEN=0]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

tinyx313.menu.cpu.attiny2313at1.bootloader.low_fuses=0x64
tinyx313.menu.cpu.attiny2313at1.bootloader.high_fuses=0x9F
tinyx313.menu.cpu.attiny2313at1.bootloader.extended_fuses=0xFF
tinyx313.menu.cpu.attiny2313at1.bootloader.file=empty/empty2313at1.hex

tinyx313.menu.cpu.attiny2313at1.build.mcu=attiny2313
tinyx313.menu.cpu.attiny2313at1.build.f_cpu=1000000L
tinyx313.menu.cpu.attiny2313at1.build.core=tiny
 
###########################################################################

